# -*- coding:utf-8 -*-
"""
author      : myRealization
create_time : 2018-09-27 16:12
program     : 网络编程基础知识
"""

"""
涉及到通讯的应用: 既有桌面程序, 又有web程序

Web程序:
# C-S架构
    - server 服务端 是我一直运行，等待服务别人
    - client 客户端 我用的时候，我才使用服务
# B-S架构
    - server
    - browser 浏览器 使用浏览器
    
为什么b/s架构在电脑端火了   -- 统一入口 解耦分治的思想
为什么b/S架构在手机端还不火 

b/s和c/s架构是什么关系  -- b/s架构是c/s架构的一种
"""

"""
# 计算机网络的发展及基础网络概论
想要实现通信，需要
    - 网卡提供了网络接口，每块网卡出场时都被烧制上世界唯一的一个MAC地址，
  长度为48位2进制，通常用12位16进制表示
IP地址:IPv4
    - 4个点分十进制 0.0.0.0-255.255.255.255
      IPv6
    - 6个点分十进制 0.0.0.0.0.0-255.255.255.255.255.255
    - 为每一台机器分配一个IP地址，确定机器是否在同一个网段内
ARP协议(数据链路层):
    - 通过IP地址就能找到MAC地址，因此实际上还是通过MAC地址访问的 

交换机的出现解决了多台机器之间的通信问题
    - 告诉所有机器的过程叫广播
    - 只告诉一台机器的叫单播
    # 广播风暴

# 广域网
为了避免广播风暴，使用了局域网，局域网的连接使用路由器Router

网关 局域网的机器想要访问局域网外的机器，需要通过网关
IP地址 按位与 子网掩码 局域网网段
"""

"""
# 端口 找到的程序 0-65535
在同一时间同一台计算机上只会有一个程序占有一个端口
端口   确定唯一的一个程序
IP+端口 确定唯一的一台机器上的唯一一个程序
"""

"""
# 计算机之间的通讯
TCP协议 全双工 打电话
    建立连接 三次握手 可靠的 面向连接的
    client -> <- server
    server -> <- client
    断开连接 四次挥手
    为什么是四次?
    应用: 文件传输 浏览器

UDP协议       发短信
    不可靠的、无连接的、快、不占连接
    应用: 域名系统(DNS) 视频流 IP语音

import socket
# AF_INET  IPv4
# AF_INET6 IPv6
"""
