# -*- coding:utf-8 -*-
"""
author      : myRealization
create_time : 2018-09-13 18:11
program     : 学习函数参数设置和传参
"""

# 位置参数 > 位置参数的动态参数 > 默认值参数 > 关键字参数的动态参数
# * 位置参数    接受到的是元组
# ** 关键字参数 接受到的是字典

# 使用：
#   在形参上*，**聚合
#   在实参上*，**打散

def func(a, b, *food, c=5, **ass):
    print(a, b, food, c, ass)


func(1, 2)  # 1 2 () 5 {}  没有传动态参数和关键字参数，默认参数采取默认值
func(1, 2, 3, 4, c=55)  # 1 2 (3, 4) 55 {} ，传了动态参数和关键字参数覆盖了默认参数值
func(1, 2, 3, 4, c=0, e=5, bad_ass='guna')  # 传了动态参数和关键字参数覆盖了默认参数值

lst = [1, 2, 3, 4]
func(*lst)  # 被位置参数+动态参数接受

dic1 = {'c':'rua', 'd':'guna'}
# 先解压lst，传入进去先给位置参数a, b，多了之后被*food收集
# 再解压dic，传入进去。
# 如果字典里覆盖了默认参数的值的话，就先传给默认参数，多了之后再被**ass收集起来
func(*lst, **dic1)  #  1 2 (3, 4) rua {'d': 'guna'}

dic2 = {'d':'gona', 'f':'c++'}
# 如果字典里没有覆盖了默认参数的值的话:
# 1 且没传关键字参数进去，就采用默认的值
# 2 传入关键字参数进去，就使用新值
func(*lst, **dic2)  # 1 2 (3, 4) 5 {'d': 'gona', 'f': 'c++'}
